

#+begin_src python :session *py* :results output :exports both :tangled /tmp/test.py
  from cryptography.hazmat.backends import default_backend
  from cryptography.hazmat.primitives.asymmetric import rsa
  from cryptography.hazmat.primitives import hashes
  from cryptography.hazmat.primitives.asymmetric import padding

  private_key = rsa.generate_private_key(
      public_exponent=65537,
      key_size=2048,
      backend=default_backend())
  public_key = private_key.public_key()

  message = b'Este es un mensaje de prueba para firmar'

  # Para generar la firma:
  signature = private_key.sign(message,
                               padding.PSS(
                                   mgf=padding.MGF1(hashes.SHA256()),
                                   salt_length=padding.PSS.MAX_LENGTH),
                               hashes.SHA256())


  print(len(signature))

  # Para verificar la firma
  try:
      public_key.verify(
          signature,
          message,
          padding.PSS(
              mgf=padding.MGF1(hashes.SHA256()),
              salt_length=padding.PSS.MAX_LENGTH),
          hashes.SHA256())
      print('La verificación pasó, de lo contrario verify lanza una excepción')
  except:
      print('No se pasó la verificación de firma')

#+end_src

#+RESULTS:
: b'\x08\xb2\x01h\xc9>\n\xa9\x9a)1(\x13(#\xfe\x05F\x7f\xa3\xb6\xfd\xb25\x8b\x06\x0f#RfK\x88\\\x98=?\x0b\xa8|I\xfa\xb2\x12y3\xd1 q\xb6l\x1d1\xf6\xa4*\xd2o\x08\x14\x00\xe3O)\x9f>\x90\x98\xde\xc7\x0e\xd7Y\xe8\xb9|T\x9c\x04\x19\xac\x1a{\xab\xc1\x1e\xd5\x11\xf6Aa\xa4\xad\xda\xe0\xccA<|\x83\xa0\xbd\xd8\xf2\x9d0\xb4t%\x9a\xc4_\x82~\xcd\x8c\xa0<O\xec\xf8\x1d)\x0f\x8b\xfeC\x1a\x06\x882l\xa5\x15|-7d\xf5A\xde\xe7\xbb\x99\x14\xcdy\x16Qx\xb8e\xe9\x06\xf2\xd5G\x85\ny^u\xde\xe2\xe5\xd7c\xaf\xc6\x1fU\xecO\\w\xab\xabSs\xba\xe2\x9c\x98\x04\x9c\x1c\x07\x84KD\xd1\xf4a\x81\xf5\xfaD\xda]\xd9a\xff\x9f:\xb6\xc3\xb1V\xa4\x0f\x95\x0c\x18Sg\xe1\x8dKaQ_\xf0\r"\xea\xb70\xff\x8a\x8f?\xa1\t\xf7\xb1\x10\x87\xf1r\xcd\x04A\xf4\x1cyH+\x9d\xff\xea\xbb\x0e\xdb\xfe\x10\x98k'
: La verificación pasó, de lo contrario verify lanza una excepción
